### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

Terraform will perform the following actions:

  # aws_glue_crawler.crawler["ingest_json"] will be created
+   resource "aws_glue_crawler" "crawler" {
+       arn           = (known after apply)
+       database_name = "abdo6-grupo-k-ci-deploy"
+       id            = (known after apply)
+       name          = "ingest_json"
+       role          = (known after apply)
+       tags_all      = (known after apply)

+       s3_target {
+           path = "s3://abdo6-grupo-k-ci-deploy/ingest_json/"
        }
    }

  # aws_glue_crawler.crawler["ingest_json_crawler"] will be destroyed
  # (because key ["ingest_json_crawler"] is not in for_each map)
-   resource "aws_glue_crawler" "crawler" {
-       arn           = "arn:aws:glue:us-west-2:007774094020:crawler/ingest_json_crawler" -> null
-       classifiers   = [] -> null
-       database_name = "abdo6-grupo-k-ci-deploy" -> null
-       id            = "ingest_json_crawler" -> null
-       name          = "ingest_json_crawler" -> null
-       role          = "crawler-role-ingest_json_crawler" -> null
-       tags          = {} -> null
-       tags_all      = {} -> null

-       lineage_configuration {
-           crawler_lineage_settings = "DISABLE" -> null
        }

-       recrawl_policy {
-           recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

-       s3_target {
-           exclusions  = [] -> null
-           path        = "s3://abdo6-grupo-k-ci-deploy/ingest_json_crawler/" -> null
-           sample_size = 0 -> null
        }

-       schema_change_policy {
-           delete_behavior = "DEPRECATE_IN_DATABASE" -> null
-           update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.crawler["raw_json"] will be created
+   resource "aws_glue_crawler" "crawler" {
+       arn           = (known after apply)
+       database_name = "abdo6-grupo-k-ci-deploy"
+       id            = (known after apply)
+       name          = "raw_json"
+       role          = (known after apply)
+       tags_all      = (known after apply)

+       s3_target {
+           path = "s3://abdo6-grupo-k-ci-deploy/raw_json/"
        }
    }

  # aws_glue_crawler.crawler["raw_json_crawler"] will be destroyed
  # (because key ["raw_json_crawler"] is not in for_each map)
-   resource "aws_glue_crawler" "crawler" {
-       arn           = "arn:aws:glue:us-west-2:007774094020:crawler/raw_json_crawler" -> null
-       classifiers   = [] -> null
-       database_name = "abdo6-grupo-k-ci-deploy" -> null
-       id            = "raw_json_crawler" -> null
-       name          = "raw_json_crawler" -> null
-       role          = "crawler-role-raw_json_crawler" -> null
-       tags          = {} -> null
-       tags_all      = {} -> null

-       lineage_configuration {
-           crawler_lineage_settings = "DISABLE" -> null
        }

-       recrawl_policy {
-           recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

-       s3_target {
-           exclusions  = [] -> null
-           path        = "s3://abdo6-grupo-k-ci-deploy/raw_json_crawler/" -> null
-           sample_size = 0 -> null
        }

-       schema_change_policy {
-           delete_behavior = "DEPRECATE_IN_DATABASE" -> null
-           update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_job.transform-to-parquet will be updated in-place
!   resource "aws_glue_job" "transform-to-parquet" {
        id                        = "transform-to-parquet"
        name                      = "transform-to-parquet"
!       role_arn                  = "arn:aws:iam::007774094020:role/crawler-role-ingest_json_crawler" -> (known after apply)
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_role.crawler-role["ingest_json"] will be created
+   resource "aws_iam_role" "crawler-role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "glue.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "crawler-role-ingest_json"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role.crawler-role["ingest_json_crawler"] will be destroyed
  # (because key ["ingest_json_crawler"] is not in for_each map)
-   resource "aws_iam_role" "crawler-role" {
-       arn                   = "arn:aws:iam::007774094020:role/crawler-role-ingest_json_crawler" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "glue.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2022-10-06T04:54:28Z" -> null
-       force_detach_policies = false -> null
-       id                    = "crawler-role-ingest_json_crawler" -> null
-       managed_policy_arns   = [] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "crawler-role-ingest_json_crawler" -> null
-       path                  = "/" -> null
-       tags                  = {} -> null
-       tags_all              = {} -> null
-       unique_id             = "AROAQDT27ILCFZULBCEUI" -> null

-       inline_policy {
-           name   = "crawler-role-policy" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "glue:*",
-                               "s3:GetBucketLocation",
-                               "s3:ListBucket",
-                               "s3:ListAllMyBuckets",
-                               "s3:GetBucketAcl",
-                               "ec2:DescribeVpcEndpoints",
-                               "ec2:DescribeRouteTables",
-                               "ec2:CreateNetworkInterface",
-                               "ec2:DeleteNetworkInterface",
-                               "ec2:DescribeNetworkInterfaces",
-                               "ec2:DescribeSecurityGroups",
-                               "ec2:DescribeSubnets",
-                               "ec2:DescribeVpcAttribute",
-                               "iam:ListRolePolicies",
-                               "iam:GetRole",
-                               "iam:GetRolePolicy",
-                               "cloudwatch:PutMetricData",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:CreateBucket",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::aws-glue-*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:GetObject",
-                               "s3:PutObject",
-                               "s3:DeleteObject",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::aws-glue-*/*",
-                               "arn:aws:s3:::*/*aws-glue-*/*",
-                               "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:GetObject",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::crawler-public*",
-                               "arn:aws:s3:::aws-glue-*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "logs:CreateLogGroup",
-                               "logs:CreateLogStream",
-                               "logs:PutLogEvents",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:logs:*:*:/aws-glue/*",
                            ]
                        },
-                       {
-                           Action    = [
-                               "ec2:CreateTags",
-                               "ec2:DeleteTags",
                            ]
-                           Condition = {
-                               "ForAllValues:StringEquals" = {
-                                   "aws:TagKeys" = [
-                                       "aws-glue-service-resource",
                                    ]
                                }
                            }
-                           Effect    = "Allow"
-                           Resource  = [
-                               "arn:aws:ec2:*:*:network-interface/*",
-                               "arn:aws:ec2:*:*:security-group/*",
-                               "arn:aws:ec2:*:*:instance/*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:GetObject",
-                               "s3:PutObject",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::abdo6-grupo-k-ci-deploy/ingest_json_crawler*",
                            ]
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.crawler-role["raw_json"] will be created
+   resource "aws_iam_role" "crawler-role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "glue.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "crawler-role-raw_json"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role.crawler-role["raw_json_crawler"] will be destroyed
  # (because key ["raw_json_crawler"] is not in for_each map)
-   resource "aws_iam_role" "crawler-role" {
-       arn                   = "arn:aws:iam::007774094020:role/crawler-role-raw_json_crawler" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "glue.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2022-10-06T04:54:28Z" -> null
-       force_detach_policies = false -> null
-       id                    = "crawler-role-raw_json_crawler" -> null
-       managed_policy_arns   = [] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "crawler-role-raw_json_crawler" -> null
-       path                  = "/" -> null
-       tags                  = {} -> null
-       tags_all              = {} -> null
-       unique_id             = "AROAQDT27ILCCLLVIJDVE" -> null

-       inline_policy {
-           name   = "crawler-role-policy" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "glue:*",
-                               "s3:GetBucketLocation",
-                               "s3:ListBucket",
-                               "s3:ListAllMyBuckets",
-                               "s3:GetBucketAcl",
-                               "ec2:DescribeVpcEndpoints",
-                               "ec2:DescribeRouteTables",
-                               "ec2:CreateNetworkInterface",
-                               "ec2:DeleteNetworkInterface",
-                               "ec2:DescribeNetworkInterfaces",
-                               "ec2:DescribeSecurityGroups",
-                               "ec2:DescribeSubnets",
-                               "ec2:DescribeVpcAttribute",
-                               "iam:ListRolePolicies",
-                               "iam:GetRole",
-                               "iam:GetRolePolicy",
-                               "cloudwatch:PutMetricData",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:CreateBucket",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::aws-glue-*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:GetObject",
-                               "s3:PutObject",
-                               "s3:DeleteObject",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::aws-glue-*/*",
-                               "arn:aws:s3:::*/*aws-glue-*/*",
-                               "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:GetObject",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::crawler-public*",
-                               "arn:aws:s3:::aws-glue-*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "logs:CreateLogGroup",
-                               "logs:CreateLogStream",
-                               "logs:PutLogEvents",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:logs:*:*:/aws-glue/*",
                            ]
                        },
-                       {
-                           Action    = [
-                               "ec2:CreateTags",
-                               "ec2:DeleteTags",
                            ]
-                           Condition = {
-                               "ForAllValues:StringEquals" = {
-                                   "aws:TagKeys" = [
-                                       "aws-glue-service-resource",
                                    ]
                                }
                            }
-                           Effect    = "Allow"
-                           Resource  = [
-                               "arn:aws:ec2:*:*:network-interface/*",
-                               "arn:aws:ec2:*:*:security-group/*",
-                               "arn:aws:ec2:*:*:instance/*",
                            ]
                        },
-                       {
-                           Action   = [
-                               "s3:GetObject",
-                               "s3:PutObject",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::abdo6-grupo-k-ci-deploy/raw_json_crawler*",
                            ]
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.crawler-role-policy["ingest_json"] will be created
+   resource "aws_iam_role_policy" "crawler-role-policy" {
+       id     = (known after apply)
+       name   = "crawler-role-policy"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "glue:*",
+                           "s3:GetBucketLocation",
+                           "s3:ListBucket",
+                           "s3:ListAllMyBuckets",
+                           "s3:GetBucketAcl",
+                           "ec2:DescribeVpcEndpoints",
+                           "ec2:DescribeRouteTables",
+                           "ec2:CreateNetworkInterface",
+                           "ec2:DeleteNetworkInterface",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeVpcAttribute",
+                           "iam:ListRolePolicies",
+                           "iam:GetRole",
+                           "iam:GetRolePolicy",
+                           "cloudwatch:PutMetricData",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:CreateBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
+                           "s3:DeleteObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*/*",
+                           "arn:aws:s3:::*/*aws-glue-*/*",
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::crawler-public*",
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "logs:CreateLogGroup",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
+                   {
+                       Action    = [
+                           "ec2:CreateTags",
+                           "ec2:DeleteTags",
                        ]
+                       Condition = {
+                           "ForAllValues:StringEquals" = {
+                               "aws:TagKeys" = [
+                                   "aws-glue-service-resource",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:network-interface/*",
+                           "arn:aws:ec2:*:*:security-group/*",
+                           "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/ingest_json*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # aws_iam_role_policy.crawler-role-policy["ingest_json_crawler"] will be destroyed
  # (because key ["ingest_json_crawler"] is not in for_each map)
-   resource "aws_iam_role_policy" "crawler-role-policy" {
-       id     = "crawler-role-ingest_json_crawler:crawler-role-policy" -> null
-       name   = "crawler-role-policy" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "glue:*",
-                           "s3:GetBucketLocation",
-                           "s3:ListBucket",
-                           "s3:ListAllMyBuckets",
-                           "s3:GetBucketAcl",
-                           "ec2:DescribeVpcEndpoints",
-                           "ec2:DescribeRouteTables",
-                           "ec2:CreateNetworkInterface",
-                           "ec2:DeleteNetworkInterface",
-                           "ec2:DescribeNetworkInterfaces",
-                           "ec2:DescribeSecurityGroups",
-                           "ec2:DescribeSubnets",
-                           "ec2:DescribeVpcAttribute",
-                           "iam:ListRolePolicies",
-                           "iam:GetRole",
-                           "iam:GetRolePolicy",
-                           "cloudwatch:PutMetricData",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:CreateBucket",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:GetObject",
-                           "s3:PutObject",
-                           "s3:DeleteObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::aws-glue-*/*",
-                           "arn:aws:s3:::*/*aws-glue-*/*",
-                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:GetObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::crawler-public*",
-                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "logs:CreateLogGroup",
-                           "logs:CreateLogStream",
-                           "logs:PutLogEvents",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
-                   {
-                       Action    = [
-                           "ec2:CreateTags",
-                           "ec2:DeleteTags",
                        ]
-                       Condition = {
-                           "ForAllValues:StringEquals" = {
-                               "aws:TagKeys" = [
-                                   "aws-glue-service-resource",
                                ]
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = [
-                           "arn:aws:ec2:*:*:network-interface/*",
-                           "arn:aws:ec2:*:*:security-group/*",
-                           "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:GetObject",
-                           "s3:PutObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/ingest_json_crawler*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "crawler-role-ingest_json_crawler" -> null
    }

  # aws_iam_role_policy.crawler-role-policy["raw_json"] will be created
+   resource "aws_iam_role_policy" "crawler-role-policy" {
+       id     = (known after apply)
+       name   = "crawler-role-policy"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "glue:*",
+                           "s3:GetBucketLocation",
+                           "s3:ListBucket",
+                           "s3:ListAllMyBuckets",
+                           "s3:GetBucketAcl",
+                           "ec2:DescribeVpcEndpoints",
+                           "ec2:DescribeRouteTables",
+                           "ec2:CreateNetworkInterface",
+                           "ec2:DeleteNetworkInterface",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeVpcAttribute",
+                           "iam:ListRolePolicies",
+                           "iam:GetRole",
+                           "iam:GetRolePolicy",
+                           "cloudwatch:PutMetricData",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:CreateBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
+                           "s3:DeleteObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::aws-glue-*/*",
+                           "arn:aws:s3:::*/*aws-glue-*/*",
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::crawler-public*",
+                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "logs:CreateLogGroup",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
+                   {
+                       Action    = [
+                           "ec2:CreateTags",
+                           "ec2:DeleteTags",
                        ]
+                       Condition = {
+                           "ForAllValues:StringEquals" = {
+                               "aws:TagKeys" = [
+                                   "aws-glue-service-resource",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:network-interface/*",
+                           "arn:aws:ec2:*:*:security-group/*",
+                           "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/raw_json*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # aws_iam_role_policy.crawler-role-policy["raw_json_crawler"] will be destroyed
  # (because key ["raw_json_crawler"] is not in for_each map)
-   resource "aws_iam_role_policy" "crawler-role-policy" {
-       id     = "crawler-role-raw_json_crawler:crawler-role-policy" -> null
-       name   = "crawler-role-policy" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "glue:*",
-                           "s3:GetBucketLocation",
-                           "s3:ListBucket",
-                           "s3:ListAllMyBuckets",
-                           "s3:GetBucketAcl",
-                           "ec2:DescribeVpcEndpoints",
-                           "ec2:DescribeRouteTables",
-                           "ec2:CreateNetworkInterface",
-                           "ec2:DeleteNetworkInterface",
-                           "ec2:DescribeNetworkInterfaces",
-                           "ec2:DescribeSecurityGroups",
-                           "ec2:DescribeSubnets",
-                           "ec2:DescribeVpcAttribute",
-                           "iam:ListRolePolicies",
-                           "iam:GetRole",
-                           "iam:GetRolePolicy",
-                           "cloudwatch:PutMetricData",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:CreateBucket",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:GetObject",
-                           "s3:PutObject",
-                           "s3:DeleteObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::aws-glue-*/*",
-                           "arn:aws:s3:::*/*aws-glue-*/*",
-                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:GetObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::crawler-public*",
-                           "arn:aws:s3:::aws-glue-*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "logs:CreateLogGroup",
-                           "logs:CreateLogStream",
-                           "logs:PutLogEvents",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
-                   {
-                       Action    = [
-                           "ec2:CreateTags",
-                           "ec2:DeleteTags",
                        ]
-                       Condition = {
-                           "ForAllValues:StringEquals" = {
-                               "aws:TagKeys" = [
-                                   "aws-glue-service-resource",
                                ]
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = [
-                           "arn:aws:ec2:*:*:network-interface/*",
-                           "arn:aws:ec2:*:*:security-group/*",
-                           "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
-                   {
-                       Action   = [
-                           "s3:GetObject",
-                           "s3:PutObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::abdo6-grupo-k-ci-deploy/raw_json_crawler*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "crawler-role-raw_json_crawler" -> null
    }

Plan: 6 to add, 1 to change, 6 to destroy.
```
</details>